[
  {
    "name": "Joe Dreste",
    "role": "Best Man",
    "background": "Joe and Matt have been friends since Joe's mom started babysitting Matt and his sister Katie when Matt was in the 3rd grade.  Whether it was playing hide and go seek or Nintendo at Matt's house after spending the day at the subdivision pool in the summer, or playing wiffle ball, soccer, or hockey in Joe's front yard, the two of them always have found something fun to do.  One of Matt's favorite memories with Joe was when they and Matt's family went to Florida one year and on the drive down we stopped at a Waffle House to eat and use the restroom.  The men's room was already taken, so Matt convinced Joe to use the women's restroom as he'd keep guard so no woman went in there.  As soon as Joe walked in, Matt left his post leaving Joe to fend for himself!  It was pretty funny."
  },
  {
    "name": "Nick LoPiccolo",
    "role": "Groomsman",
    "background": "As kids, Nick lived across the street from Joe and we all played in hockey in the street together.  Everyone would give Nick trouble about being the youngest of all us, something now Nick takes pride in.  He used to say he couldn't wait until we were all older and getting closer to 40 as he'd still be in his mid 30's.  Like Joe, Matt and Nick have known each other for most of their lives and are still close friends.  We all still find time to hang out every now and then.  One year before Christmas, we were at a restaurant and Joe and Nick convinced Matt to try online dating.  Matt for some reason listened and it turned out to be a good thing obviously!"
  },
  {
    "name": "Keola Aki",
    "role": "Groomsman",
    "background": "At the start of a new semester at Creighton, in one of many Philosphy classes students were forced to take, Keola sat next to Matt and that's how their friendship began.  The following two years at Creighton they were roommates.  After Matt graduated and Keola was still attending and changing his degree 50 more times, Keola moved in with Matt and another friend in exciting downtown Omaha.  Keola really helped to make Creighton a fun and memorable experience as he became a great friend.  Despite living in Hawaii, Keola and Matt still keep in touch and Matt was in Keola's wedding which took place in Las Vegas a few years ago.  Unfortunately, the wedding wasn't in Hawaii.  But it's okay as Matt always knows he has a free place to stay when he wants to visit Hawaii again!"
  },
  {
    "name": "Shawn Cothron",
    "role": "Groomsman",
    "background": "Matt and Shawn are brother-in-laws.  We have the honor of knowing each thru Matt's 'wonderful' sister Katie.  Matt was in their wedding, along with their dog who was also in the wedding for some reason.  Shawn is still a good guy, even after being with Katie this long.  She hasn't completely rubbed off on him yet.  The two of them live happily with their dog, cat, 2 new born baby twin boys and the cutest niece in the world, Sydney."
  },
  {
    "name": "Luther Ester",
    "role": "Groomsman",
    "background": "Luther and Matt met while Matt worked at Scottrade several years ago.  Even after Matt left Scottrade, they still keep in touch as they play hockey together on a Sunday roller hockey league.  Luther enjoys playing and watching sports just as much as Matt does and that has helped to form a strong friendship.  Luther is a really funny guy who can always make anyone laugh.  He's also one of the nicest guy you could meet."
  },
  {
    "name": "Doug Wehmeyer",
    "role": "Groomsman",
    "background": "Matt met Doug thru Doug's eventual wife, Amy.  She said her boyfriend at the time was really good at baseball and hockey and wanted to play again.  That's how I got to know Doug, and got to know that Amy wasn't the best judge of athletic talent. Doug has been a good friend for many years and a very nice guy, despite Matt helping to almost drop Doug's big screen tv on him when we were moving it into Doug's basement."
  },
  {
    "name": "Jim Borawski",
    "role": "Usher",
    "background": "Jim and Matt have been friends since they both moved to Oakville and started attending Point Elementary.  Matt started in the beginning of the school year while Jim started later.  Matt remembers Jim used to sit right behind him and they quickly became friends.  Both Jim and Matt played hockey together in the subdivision streets as well as in school parking lots in Oakville."
  },
  {
    "name": "Joe Borawski",
    "role": "Usher",
    "background": "Being that Jim and Joe Borawski are twins, it didn't take long for Matt to meet Joe after becoming friends with Jim.  Hockey brought everyone together and it was no different on how I became friends with Joe.  All of us spent many nights at the Borawski household in our highschool and college years playing video and board games."
  },
  {
    "name": "Mike Solakian",
    "role": "Usher",
    "background": "Mike is Becky’s brother. Besides the obvious similarities, they both are TV producers who went to Mizzou. Becky was so excited when she learned her little brother was going to take in her footsteps and go to MU. They got to share several Saturday’s together at Mizzou tailgates and talking about journalism together. They also have a shared passion for Dave Matthews, sports and food. Mike and Becky are still trying to get Matt to embrace Dave Matthews and Mizzou the way they do. Luckily, they will have plenty of time to work on it in the future."
  }
]
