[
  {
    "name": "Margaret Calkins",
    "role": "Matron Of Honor",
    "background": "Margaret is Becky’s best-friend. Despite living hours and hundreds of miles away, Becky and Margaret have been able to maintain their special relationship which started back in  middle school. One thing that hasn’t changed is their ability to always find something to talk about. When Becky doesn’t get a text or call from Margaret every day, Matt asks, “is everything ok?”. Margaret and Becky can often finish each others sentences and share the same thoughts. Margaret even got a cellphone from the same company as Becky during college just so she could talk to her for free. They also  enjoy spending time with each other’s families and treat them like extensions of their own. The friends have enjoyed numerous trips, days at the beach, concerts, a love for culture and a passion for life."
  },
  {
    "name": "Alison Douglas",
    "role": "Matron Of Honor",
    "background": "Alison is Becky’s sister. They are only 15 months apart and always grew up having a playmate.  Their childhood was filled with dancing, sports, Barbies, vacations and holidays.  Their mother said if she was going to have two girls, she wanted them as different as possible. While Alison and Becky’s personalities are different, their core values and the importance they put on family are not. They live in separate states but try to see their family as often as possible. Now adults, the girls appreciate the family traditions they shared as children and the importance of keeping those alive for their growing family."
  },
  {
    "name": "Amanda Lepoire",
    "role": "Bridesmaid",
    "background": "Amanda and Becky met freshman year of college at Mizzou.  Amanda and Becky got to know each other working tirelessly on the homecoming float her first year at school. They also worked together as staff members for their residence hall and shared Becky’s passion of Mizzou and The Tigers. Becky and Amanda enjoy trips back to Columbia for football games and tailgates.  When they had season tickets, they  enjoyed exposing Becky’s brother to the MU traditions. The friends have a shared love for “Grease” and have enjoyed several shows at the Muny and Fox Theater.  They’ve also participated in several 5K’s together. She was also the first person she called after her first date with Matt. Now, the girls enjoy sharing their love of life and MU with the new Tiger fans in their lives... and teaching them that KU is still the enemy."
  },
  {
    "name": "Beth Lauver",
    "role": "Bridesmaid",
    "background": "Becky met Beth her first day of college. They were roommates, a match that has led to a 16+ year friendship. It also helped that Beth was playing Dave Matthews in their dorm room as they met for that first time. Beth was the perfect person to help give Becky the information she needed to hold her own in a conversation with Missourians. Beth gave her a rundown on the high schools in STL, broke down the different counties for her and even used her hand to show Becky how the major roads in STL worked. She also taught Becky about Ted Drewes and provel cheese, one Becky still prefers not to touch to this day. Beth was a great tour guide on Becky’s first trip to STL. Her passion for her hometown planted the seed that had Becky moving to STL for a job in 2006. Her family always opened their home to Becky when she couldn’t go home for holidays, either during college or while working at the TV station.  The girls still enjoy reminiscing about their Hatch Hall days while playing with Beth’s four sons or taking trips to the park. They can’t wait to make new Mizzou and STL memories with their growing families."
  },
  {
    "name": "Cristin Blunt",
    "role": "Bridesmaid",
    "background": "Cristin and Becky met freshman year of college at Mizzou and have been friends ever since. I could not even imagine college without Cristin. She helped me develop my inner Tiger and love for everything black and gold. I remember walking around campus learning the words to the fight song together. The girls attended many football and basketball games together and credit themselves with starting the trend of wearing black and gold boas to games. The two were also on staff together for one of the residence halls and both members of the service organization, “Little sisters of the  gold rose”. They also bonded over their love for Dave. He only needs one name to them, but to everyone else he’s Dave of the Dave Matthews Band. Besides her great taste in music, Becky loves Cristin ability to make people laugh. The college friends look forward to homecoming each year and spending time with each other’s growing families."
  },
  {
    "name": "Katie Cothron",
    "role": "Bridesmaid",
    "background": "Katie is Matthew’s sister. They love to annoy each other, but what sister and brother don’t.  It can be witnessed the most during Sunday night dinners, which have become a weekly thing over the last year and a half. When the two aren’t getting jabs in, it’s a nice time to catch up and spend family time together. The get-togethers are definitely tight when it’s Matt and Becky’s turn to cook at their city home, especially now that Katie’s family includes her daughter, 4-year-old Sydney and two 8-month-old twin boys, Harrison and Cameron."
  },
  {
    "name": "Alexis Willeke",
    "role": "Junior Bridesmaid"
  },
  {
    "name": "Mya Douglas",
    "role": "Flower Girl"
  },
  {
    "name": "Juliana Salgado",
    "role": "Flower Girl"
  },
  {
    "name": "Sydney Cothron",
    "role": "Flower Girl"
  }
]
